import Toast from '@vant/weapp/toast/toast';
const db = wx.cloud.database()

Page({

  /*生命周期函数--监听页面加载*/
  onLoad: function () {
    
  },

  /*点击选择此队伍*/
  handleClick(e){
    const disease = e.currentTarget.dataset.title;
    wx.setStorage({
      key:"disease",
      data:disease
    })
    wx.navigateBack()
  },

  search(e){
    console.log(e.detail)
    let keyword = e.detail
    if(keyword == "") {
      this.setData({
        resultList: [],
        keyword
      })
      return;
    }
    let resultList = this.data.diseaseList.filter(disease => disease.includes(keyword));
    console.log(resultList)
    this.setData({
      resultList,
      keyword
    })
  },

  /**
   * 页面的初始数据
   */
  data: {
    keyword: '',
    resultList: [],
    diseaseList: [
      "Alport 综合征",
      "Angelman 氏症候群（天使综合征）",
      "白化病",
      "半乳糖血症",
      "苯丙酮尿症",
      "卟啉病",
      "丙酸血症",
      "Castleman病",
      "纯合子家族性高胆固醇血症",
      "长链3-羟酰基辅酶A脱氢酶缺乏症",
      "成骨不全症（脆骨病）",
      "低碱性磷酸酶血症",
      "低磷性佝偻病",
      "多灶性运动神经病",
      "多种酰基辅酶A脱氢酶缺乏症",
      "多发性硬化",
      "多系统萎缩",
      "Erdheim-Chester病",
      "非典型溶血性尿毒症",
      "腓骨肌萎缩症",
      "法布雷病",
      "范可尼贫血",
      "枫糖尿症",
      "非综合征性耳聋",
      "肺泡蛋白沉积症",
      "肺囊性纤维化",
      "瓜氨酸血症",
      "冠状动脉扩张病",
      "戈谢病",
      "Gitelman 综合征",
      "高苯丙氨酸血症",
      "肝豆状核变性",
      "谷固醇血症",
      "亨廷顿舞蹈病",
      "HHH综合征",
      "黑斑息肉综合征",
      "IgG4相关性疾病",
      "肌萎缩侧索硬化",
      "家族性地中海热",
      "甲基丙二酸血症",
      "肌强直性营养不良",
      "进行性家族性肝内胆汁淤积症",
      "进行性肌营养不良",
      "脊髓延髓肌萎缩症（肯尼迪病）",
      "脊髓性肌萎缩症",
      "脊髓小脑性共济失调",
      "结节性硬化症",
      "极长链酰基辅酶A脱氢酶缺乏症",
      "卡尔曼综合征",
      "朗格汉斯组织细胞增生症",
      "莱伦氏综合征",
      "Leber遗传性视神经病变",
      "淋巴管肌瘤病",
      "赖氨酸尿蛋白不耐受症",
      "镰刀型细胞贫血病",
      "黏多糖贮积症",
      "N-乙酰谷氨酸合成酶缺乏症",
      "尼曼匹克病",
      "Noonan综合征",
      "鸟氨酸氨甲酰基转移酶缺乏症",
      "帕金森病（青年型、早发型）",
      "POEMS综合征",
      "Prader-Willi综合征",
      "马凡综合征",
      "McCune-Albrigh综合征",
      "全身型重症肌无力",
      "全羧化酶合成酶缺乏症",
      "热纳综合征（窒息性胸腔失养症）",
      "溶酶体酸性脂肪酶缺乏症",
      "生物素酶缺乏症",
      "精氨酸酶缺乏症",
      "视神经脊髓炎",
      "视网膜色素变性",
      "视网膜母细胞瘤",
      "Silver-Russell综合征",
      "四氢生物蝶呤缺乏症",
      "湿疹血小板减少伴免疫缺陷综合征",
      "糖原累积病（I型、Ⅱ型）",
      "同型半胱氨酸血症",
      "特发性心肌病",
      "特发性低促性腺激素性性腺功能减退症",
      "特发性肺动脉高压",
      "特发性肺纤维化",
      "戊二酸血症I型",
      "威廉姆斯综合征",
      "心脏离子通道病",
      "先天性肾上腺发育不良",
      "先天性高胰岛素性低血糖血症",
      "先天性肌无力综合征",
      "先天性肌强直（非营养不良性肌强直综合征）",
      "先天性脊柱侧弯",
      "先天性纯红细胞再生障碍性贫血",
      "血友病",
      "先天性胆汁酸合成障碍",
      "线粒体脑肌病",
      "新生儿糖尿病",
      "系统性硬化症",
      "X-连锁无丙种球蛋白血症",
      "X-连锁肾上腺脑白质营养不良",
      "X-连锁淋巴增生症",
      "原发性肉碱缺乏症",
      "遗传性血管性水肿",
      "遗传性大疱性表皮松解症",
      "遗传性果糖不耐受症",
      "遗传性低镁血症",
      "遗传性多发脑梗死性痴呆",
      "遗传性痉挛性截瘫",
      "异戊酸血症",
      "原发性联合免疫缺陷",
      "原发性遗传性肌张力不全",
      "原发性轻链型淀粉样变",
      "婴儿严重肌阵挛性癫痫(Dravet综合征)",
      "原发性酪氨酸血症",
      "自身免疫性脑炎",
      "自身免疫性垂体炎",
      "自身免疫性胰岛素受体病",
      "中链酰基辅酶A脱氢酶缺乏症",
      "阵发性睡眠性血红蛋白尿",
      "重症先天性粒细胞缺乏症",
      "21-羟化酶缺乏症",
      "β-酮硫解酶缺乏症",
    ]
  },

  /*生命周期函数--监听页面初次渲染完成*/
  onReady: function () {

  },

  /*生命周期函数--监听页面显示*/
  onShow: function () {
    this.onLoad()
  },

  /*生命周期函数--监听页面隐藏*/
  onHide: function () {
  },

  /**生命周期函数--监听页面卸载*/
  onUnload: function () {
  },

    
  /*页面相关事件处理函数--监听用户下拉动作*/
  onPullDownRefresh: function () {
    
  },

  /* 用户点击右上角分享*/
  onShareAppMessage: function () {

  },
})